#+TITLE: Amplitude Modulation and Vowel Coding in the Stellate Microcircuit
#+AUTHOR: Michael A Eager
#+DATE:
#+OPTIONS: toc:nil H:5  <:t >:t
#+STARTUP: oddeven hideblocks fold align hidestars
#+SEQ_TODO:    TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+TODO: TODO(t) STARTED(s) | DONE(d) DEFERRED(f) REFTEX
#+LANGUAGE: en_GB-ise-wo_accents
#+LaTeX_CLASS: UoM-draft-org-article
#+LaTeX_CLASS_OPTIONS: [a4paper,11pt,twopage,openright]
#+LATEX_HEADER:\graphicspath{{../VowelProcessingChapter/gfx/}}
#+LATEX_HEADER:\setcounter{secnumdepth}{5}
#+LATEX_HEADER:\lfoot{\footnotesize\today\ at \thistime}
#+LATEX_HEADER:  %\usepackage[notcite]{showkeys}
#+BIBLIOGRAPHY: ../org-manuscript/bib/MyBib plainnat


#+LaTeX:\glsresetall[main,acronym]
#+LaTeX:\setcounter{chapter}{3}
#+LaTeX:\chapter[AM Coding in the CNSM Model]{Amplitude Modulation Coding in the Cochlear Nucleus Stellate Microcircuit Model}\label{sec:AMChapter}

#+BEGIN_LaTeX
  %\ifthenelse{\isundefined{\manuscript}}{\small{\textbf{Draft Version}: \input{../VowelResponsesChapter/.hg/cache/tags}}}{}
#+END_LaTeX

# # set global variables for in-code blocks

* Prelude                                                          :noexport:

#+name: my-latex-export
#+begin_src emacs-lisp results: silent
    (setq org-latex-to-pdf-process '("pdfquick  %f" ))
   ;; (setq org-latex-to-pdf-process '("xelatex -interaction nonstopmode %f"   "makeglossaries %b" "bibtex %b" "xelatex -interaction nonstopmode %f" "xelatex  -interaction nonstopmode %f" ))
    (setq org-export-latex-title-command "")
    (add-to-list 'org-export-latex-classes '("UoM-draft-org-article"
    "\\documentclass[11pt,a4paper,twoside,openright]{book}
    \\usepackage{../org-manuscript/style/uomthesis}
    \\input{../org-manuscript/user-defined}
    \\usepackage[acronym]{glossaries}
    \\input{../org-manuscript/misc/glossary}
    \\makeglossaries
    \\graphicspath{{../VowelProcessingChapter/gfx/}}
    \\pretolerance=150
    \\tolerance=100
    \\setlength{\\emergencystretch}{3em}
    \\overfullrule=1mm %
    % \\usepackage[notcite]{showkeys}
    \\lfoot{\\footnotesize\\today\\ at \\thistime}
      [NO-DEFAULT-PACKAGES]
      [NO-PACKAGES]"
  ("\\clearpage\\newpage\\section{%s}" . "\n\\clearpage\\section{%s}")
  ("\\subsection{%s}" . "\n\\clearpage\\subsection{%s}")
  ("\\subsubsection{%s}"  . "\n\\subsubsection{%s}")
  ("\\paragraph{%s}"  . "\n\\paragraph{%s}")
  ("\\subparagraph{%s}"  . "\n\\subparagraph{%s}")))
  (setq org-export-latex-title-command "\\singlespacing{\\tableofcontents\\printglossaries}")
#+end_src

#+RESULTS: my-latex-export
: \singlespacing{\tableofcontents\printglossaries}

#+BEGIN_SRC emacs-lisp :export none :results none silent
  (load-file "./init.el")
#+END_SRC

**** Source blocks                                                 :noexport:

#+name: mean_ANF_vsSPIKES_onCF
#+header: :exports none  :results raw replace
#+BEGIN_SRC awk :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.5.dat
  BEGIN{count=0;total=0;max=0; min=""}
  {if ($2 == 50){if ($5>5.99){if ($4>max){max=$4};total+=$4; count+=1}}}
  END{printf("%0.3g, %0.3g, %d",total/count,max, count)}
#+END_SRC

#+RESULTS: mean_ANF_vsSPIKES_onCF
| 0.392 | 0.608 | 24 |

#+name: mean_Gvs
#+BEGIN_SRC sh :exports none :results raw replace :var datapath="~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/" :var SPL=60 :var CELL=4
  grep -e '\s50\s' ${datapath}/ModulationTransferFunction/${SPL}/vsSPIKES.3.dat |awk 'BEGIN{total=0;count=0} {if ($5>5.99){total+=$4; count+=1}} END{printf("%0.3g\n",total/count)}'
#+END_SRC

#+name: vsSPIKES_onCF
#+header: :exports none  :results raw replace
#+BEGIN_SRC awk :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.0.dat
  BEGIN{count=0;total=0;max=0; maxfm=0;min=""}
  {if ($2 == 50){if ($7<0.05){if ($4>max){max=$4;maxfm=$1};total+=$4; count+=1}}}
  END{printf("%0.3g, %0.3g, %d, %d",total/count,max, count, maxfm)}
#+END_SRC


#+name: CSdatapath
#+BEGIN_SRC sh :noweb tangle :export none
  datapath="~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/"
  datapath="${HOME}/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/"
#+END_SRC

#+name: CTonedatapath
#+BEGIN_SRC gnuplot :noweb tangle :export none
  datapath="~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT1/ModulationTransferFunction/"
  datapath="~/mnt/m2p38/eagerm/cnstellate/TStellate2_CT1/ModulationTransferFunction/"
#+END_SRC

#+name: CTtwodatapath
#+BEGIN_SRC gnuplot :noweb tangle :export none
  datapath="~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/"
  datapath="~/mnt/m2p38/eagerm/cnstellate/TStellate2_CT2/ModulationTransferFunction/"
#+END_SRC

#+name: MTFmax_onCF
#+header:  :results raw :export none
#+BEGIN_SRC sh :var spl="80" :var cell="0" :var Ch="S" :noweb yes
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{max=0;maxfm=50}{if ($2 == 50){if($7<0.05){if ($4>max){max=$4;maxfm=$1}}}}END{printf("%0.3g at $\\fm=%d$ Hz",max,maxfm)}' \
  ${datapath}/ModulationTransferFunction/${spl}/vsSPIKES.${cell}.dat
#+END_SRC

# call _ MTFmax _ onCF(spl="80",cell="2")[ :results replace raw ]

#+name: MTFmean_onCF
#+header:  :results raw :export none
#+BEGIN_SRC sh :var spl="80" :var cell="0" :var Ch="S" :noweb yes
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{total=0;count=0}{if ($2 == 50){if($7<0.05){total+=$4;count+=1}}}END{if(count == 0){printf("0")}else{printf("%0.3g",total/count)}}' \
  ${datapath}/ModulationTransferFunction/${spl}/vsSPIKES.${cell}.dat
#+END_SRC

# call _ MTFmean _ onCF(spl="80",cell="2")[ :results replace raw ]


#+name: MTFmaxpos
#+header:  :results raw :export none
#+BEGIN_SRC sh :var spl="80" :var cell="0" :var Ch="S" :noweb yes
 # Find maximum point in MTF map excluding p>0.05 and N<50
 # Input file format:
 # <fm|Channel|CF|SI|RaylTest|N|pval>
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{max=0;maxfm=0;maxcf=0}
  {if($7<0.05 && $5>50){if(max<$4){max=$4;maxfm=$1;maxcf=$3;}}}
  END{printf("%0.3g at \\CF=%0.3g kHz and \\fm=%.3g Hz",max,maxcf/1000,maxfm)}' \
  ${datapath}/ModulationTransferFunction/${spl}/vsSPIKES.${cell}.dat
#+END_SRC

# call _ MTFmax _ onCF(spl="80",cell="2")[ :results replace raw ]


#+name: F0maxpos
#+header:  :results raw :export none
#+BEGIN_SRC sh  :var cell="0" :var Ch="S" :noweb yes
 # Find maximum point in F0 map excluding pval>0.05 and N<50
 # Input file format:
 # <SPL|Channel|CF|SI|RaylTest|N|pval>
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{max=0;maxspl=0;maxcf=0}
  {if($7<0.05 && $5>50){if(max<$4){max=$4;maxspl=$1;maxcf=$3;}}}
  END{printf("%0.3g %0.3g kHz at %d dB SPL",max,maxcf/1000,maxspl)}' \
 ${datapath}/F0Response/vsSPIKES.${cell}.dat
#+END_SRC

# call _ F0maxpos _ onCF(cell="2",Ch="S")[ :results replace raw ]



#+name: MTFmax_onCF
#+header:  :results raw :export none
#+BEGIN_SRC sh :var spl="80" :var cell="0" :var Ch="S" :noweb yes
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{max=0}{if ($2 == 50){if($7<0.05){if ($4>max){max=$4}}}}END{printf("%0.3g",max)}' \
  ${datapath}/ModulationTransferFunction/${spl}/vsSPIKES.${cell}.dat
#+END_SRC


#+name: MTFmean_onCF
#+header:  :results raw :export none
#+BEGIN_SRC sh :var spl="80" :var cell="0" :var Ch="S" :noweb yes
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{total=0;count=0}{if ($2 == 50){if($7<0.05){total+=$4;count+=1}}}END{if(count == 0){printf("0")}else{printf("%0.3g",total/count)}}' \
  ${datapath}/ModulationTransferFunction/${spl}/vsSPIKES.${cell}.dat
#+END_SRC

#+name: F0max_onCF
#+header:  :results raw :export none
#+BEGIN_SRC sh  :var cell="0" :var Ch="S" :noweb yes
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{max=0}{if ($2 == 50){if($7<0.05){if ($4>max){max=$4}}}}END{printf("%0.3g",max)}' \
  ${datapath}/F0Response/vsSPIKES.${cell}.dat
#+END_SRC

# call _ F0max _ onCF(cell="2",Ch="S")[ :results replace raw ]

#+name: F0mean_onCF
#+header:  :results raw :export none
#+BEGIN_SRC sh  :var cell="0" :var Ch="S" :noweb yes
 <<CSdatapath>>;
 datapath=$(echo ${datapath}|sed 's/_CS/_C'$Ch'/')
 awk 'BEGIN{total=0;count=0;}
  {if ($2 == 50){if($7<0.05){total+=$4;count+=1;}}}
  END{if(count == 0){print 0}else{printf("%0.3g",total/count)}}' \
 ${datapath}/F0Response/vsSPIKES.${cell}.dat
#+END_SRC

# call _ F0mean _ onCF(cell="2",Ch="S")[ :results replace raw ]


#+name: mean_vsSPIKES_onCFb
#+header: :exports none  :results raw replace
#+BEGIN_SRC awk :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.0.dat
  BEGIN{count=0;total=0;max=0; maxfm=0;min=""}
  {if ($2 == 50){if ($7<0.05){if ($4>max){max=$4;maxfm=$1};total+=$4; count+=1}}}
  END{printf("%0.3g, %0.3g, %d, %d",total/count,max, count, maxfm)}
#+END_SRC

#+RESULTS: mean_vsSPIKES_onCFb
| 0.559 | 0.863 | 19 | 350 |

#+name: mean_vsSPIKES_onCF
#+header: :exports none  :results raw replace
#+BEGIN_SRC awk :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.0.dat
  BEGIN{count=0;total=0;}
  {if ($2 == 50){if ($7<0.05){total+=$4; count+=1}}}
  END{printf("%0.3g",total/count)}
#+END_SRC

#+name: max_vsSPIKES_onCF
#+header: :exports none  :results raw replace
#+BEGIN_SRC awk :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.0.dat
  BEGIN{max=0;}
  {if ($2 == 50){if ($7<0.05){if ($4>max){max=$4};}}}
  END{printf("%0.3g",max)}
#+END_SRC

#+name: maxpos_vsSPIKES_onCF
#+header: :exports none  :results raw replace
#+BEGIN_SRC awk :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.0.dat
  BEGIN{max=0; maxfm=0;}
  {if ($2 == 50){if ($7<0.05){if ($4>max){max=$4;maxfm=$1};}}}
  END{printf("%d",maxfm)}
#+END_SRC

#+name: count_vsSPIKES_onCF
#+header: :exports none  :results raw replace
#+BEGIN_SRC awk :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.0.dat
  BEGIN{count=0;}
  {if ($2 == 50){if ($7<0.05){count+=1}}}
  END{printf("%d",count)}
#+END_SRC


# + BEGIN_SRC sh :noweb yes
#  awk '<<mean_vsSPIKES_onCF>>' ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/20/vsSPIKES.4.dat
# + END_SRC


call_mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/20/vsSPIKES.4.dat ]()

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/20/vsSPIKES.4.dat ]()
| 0.008 | 0.0276 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT1/ModulationTransferFunction/20/vsSPIKES.4.dat ]()
| 0.00822 | 0.0297 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/20/vsSPIKES.4.dat ]()
| 0.00822 | 0.0297 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/40/vsSPIKES.4.dat ]()
| 0.00822 | 0.0308 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT1/ModulationTransferFunction/40/vsSPIKES.4.dat ]()
| 0.00822 | 0.0308 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/40/vsSPIKES.4.dat ]()
| 0.00794 | 0.0242 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/40/vsSPIKES.5.dat ]()
| 0.156 | 0.343 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CS/ModulationTransferFunction/40/vsSPIKES.5.dat ]()
| 0.208 | 0.553 | 24 |

#+RESULTS: mean_ANF_vsSPIKES_onCF[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT1/ModulationTransferFunction/40/vsSPIKES.5.dat ]()
| 0.208 | 0.553 | 24 |


#+RESULTS: mean_ANF_vsSPIKES_onCF() :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/20/vsSPIKES.4.dat
| 0.252 | 0.539 | 24 |

call_mean_ANF_vsSPIKES_onCF()[ :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/80/vsSPIKES.4.dat ]

#+RESULTS: mean_ANF_vsSPIKES_onCF() :in-file ~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/ModulationTransferFunction/80/vsSPIKES.4.dat
| 0.392 | 0.608 | 24 |


call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/20/vsSPIKES.4.dat ]()[ :results raw replace ]

#+RESULTS: mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/20/vsSPIKES.4.dat ]() :results raw replace
| 0.525 | 0.746 | 24 | 250 |

call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/40/vsSPIKES.4.dat ]()[ :results raw replace ]

#+RESULTS: mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/40/vsSPIKES.4.dat ]() :results raw replace
| 0.129 | 0.197 | 24 | 250 |

call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/60/vsSPIKES.4.dat ]()[ :results raw replace ]

#+RESULTS: mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/60/vsSPIKES.4.dat ]() :results raw replace
| 0.0261 | 0.0314 | 24 | 500 |

call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.4.dat ]()[ :results raw replace ]
| 0.0602 | 0.391 | 22 | 500 |


call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/20/vsSPIKES.5.dat ]()[ :results raw replace ]

#+RESULTS: mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/20/vsSPIKES.5.dat ]() :results raw replace
| 0.452 | 0.737 | 24 | 50 |

call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/40/vsSPIKES.5.dat ]()[ :results raw replace ]

#+RESULTS: mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/40/vsSPIKES.5.dat ]() :results raw replace
| 0.384 | 0.619 | 24 | 150 |

call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/60/vsSPIKES.5.dat ]()[ :results raw replace ]

#+RESULTS: mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/60/vsSPIKES.5.dat ]() :results raw replace
| 0.326 | 0.478 | 24 | 250 |

call_mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.5.dat ]()[ :results raw replace ]

#+RESULTS: mean_vsSPIKES_onCF[ :in-file ~/mnt/m2p38/eagerm/cnstellate/TStellate2_CS/ModulationTransferFunction/80/vsSPIKES.5.dat ]() :results raw replace
| 0.362 | 0.516 | 24 | 500 |


#+name: mean_ANFvs
#+BEGIN_SRC sh :exports none :results raw replace  :var datapath="~/Work/cnstellate/MASSIVE/cnstellate/TStellate2_CT2/" :var SPL=60 :var CELL=4
  vsfile=${datapath}/ModulationTransferFunction/${SPL}/vsSPIKES.${CELL}.dat
  echo $vsfile
  grep -e '\s50\s' ${vsfile} | awk 'BEGIN{total=0;count=0} {if ($5>5.99){total+=$4; count+=1}} END{printf("%0.3g\n",total/count)}'
#+END_SRC

# call _ mean _ ANFvs()

#+RESULTS: mean_ANFvs()
: nil


